// Реализовать следующие классы Круг, Треугольник и Квадрат, которые наследуются от Figure.
// Каждый экземпляр класса должен содержать свойства Площадь и Имя.
// Вывести всю информацию о фигурах в консоль. Площадь должна рассчитываться по математическим формулам.

// Класс Figure содержит поля:
// p
// r
// a
// h

// Дочерние классы содержаь геттеры на получение площади

class Figure {
  P;
  r;
  a;
  h;
}

class Circle extends Figure {

}

class Triangle extends Figure {

}

class Square extends Figure {

}
